Repository: darktable-org/darktable
Catalog: doc/usermanual/po/cs.tmx
Source language: en
Languages: cs

source: invalid png header from %s
cs: neplatná hlavička png u %s

source: png bit-depth %d not supported
cs: bitová hloubka %d není podporována pro png

source: invalid level in png file %d %d
cs: neplatná úroveň v souboru png %d %d

source: error - allocating buffer for png lut
cs: chyba - alokace vyrovnávací paměti pro png LUT

source: error - could not read png image %s
cs: chyba - nelze číst soubor png %s

source: error - invalid cube file: %s
cs: chyba - neplatný soubor cube LUT: %s

source: DOMAIN MIN <> 0.0 is not supported
cs: DOMAIN MIN <> 0.0 není podporováno

source: DOMAIN MAX <> 1.0 is not supported
cs: DOMAIN MAX <> 1.0 není podporováno

source: 1D cube lut is not supported
cs: 1D cube LUT není podporováno

source: error - allocating buffer for cube lut
cs: chyba - alokace vyrovnávací paměti pro cube LUT

source: error - cube lut size is not defined
cs: chyba - velikost cube LUT není definována

source: error - cube lut lines number is not correct
cs: chyba - počet linií cube LUT není správný

source: Lut root folder not defined
cs: kořenová složka pro LUT není definována

source: select lut file
cs: vybrat soubor LUT

source: _select
cs: _vybrat

source: all files
cs: všechny soubory

source: Select file outside Lut root folder is not allowed
cs: vybrat soubor mimo kořenovou složku LUT není povoleno

source: select a png (haldclut) or a cube file
cs: vybrat soubor png (ladclut) nebo cube

source: the file path (relative to lut folder) is saved with image (and not the lut data themselves) CAUTION: lut folder must be set in preferences/core options/miscellaneous before choosing the lut file
cs: souborová cesta (relativní vůči složce LUT) je uložena spolu se souborem (a nikoliv samotná data LUT) UPOZORNĚNÍ: složka LUT musí být nastavena v předvolbách/hlavní volby/různé předtím, než se vybere soubor LUT

source: application color space
cs: prostor barev pro aplikaci

source: select the color space in which the LUT has to be applied
cs: vybrat barvový prostor, ve kterém bude aplikováno LUT

source: interpolation
cs: interpolace

source: trilinear
cs: trilineární

source: pyramid
cs: pyramida

source: select the interpolation method
cs: vybrat metodu interpolace

source: mask manager
cs: manažer masek

source: monochrome
cs: filtr pro čb

source: red filter
cs: červený filtr

source: drag and scroll mouse wheel to adjust the virtual color filter
cs: pro upravení virtuálního barevného filtru klikněte a táhněte nebo rolujte kolečkem myši

source: how much to keep highlights
cs: jak moc zachovat světla

source: denoise (non-local means)
cs: odšumění

source: radius of the patches to match
cs: poloměr vzorků, které mají být vybrány

source: how much to smooth brightness
cs: do jaké míry vyhladit jasy

source: how much to smooth colors
cs: do jaké míry vyhladit barvy

source: overexposed
cs: přeexpozice

source: unbreak input profile
cs: upravit vstupní profil

source: dynamic range
cs: dynamický rozsah

source: grey point
cs: šedý bod

source: shadows range
cs: rozsah stínů

source: 16 EV dynamic range (generic)
cs: 16 EV dynamický rozsah (generický)

source: 14 EV dynamic range (generic)
cs: 14 EV dynamický rozsah (generický)

source: 12 EV dynamic range (generic)
cs: 12 EV dynamický rozsah (generický)

source: 10 EV dynamic range (generic)
cs: 10 EV dynamický rozsah (generický)

source: 08 EV dynamic range (generic)
cs: 08 EV dynamický rozsah (generický)

source: tone mapping method
cs: metoda mapování tónů

source: linear part
cs: lineární část

source: gamma exponential factor
cs: exponenciální faktor gama

source: middle grey luma
cs: jas střední šedé

source: adjust to match the average luma of the subject
cs: upravit pro nastavení průměrného jasu předmětu

source: number of stops between middle grey and pure black this is a reading a posemeter would give you on the scene
cs: počet clon mezi střední šedou a čistou černou toto je hodnota, kterou byste získali při měření scény expozimetrem

source: number of stops between pure black and pure white this is a reading a posemeter would give you on the scene
cs: počet clon mezi čistou černou a čistou bílou toto je hodnota, kterou byste získali při měření scény expozimetrem

source: optimize automatically
cs: optimalizovat automaticky

source: enlarge or shrink the computed dynamic range this is useful when noise perturbates the measurements
cs: zvětšit či zmenšit vypočtený dynamický rozsah toto je užitečné, když jsou měření ovlivněna šumem

source: make an optimization with some guessing
cs: provést optimalizaci s trochou hádání

source: raw denoise
cs: odšumět raw

source: noise threshold
cs: práh šumu

source: raw denoising only works for raw images.
cs: odšumění raw pouze snímky raw.

source: raw overexposed
cs: přeexpozice raw

source: crop x
cs: ořez x

source: crop from left border
cs: ořez z levého okraje

source: crop y
cs: ořez y

source: crop from top
cs: ořez shora

source: crop width
cs: šířka ořezu

source: crop from right border
cs: ořez z pravého okraje

source: crop height
cs: výška ořezu

source: crop from bottom
cs: ořez ze spodu

source: raw black/white point
cs: černý/bílý bod snímku raw

source: passthrough
cs: průchozí

source: black level %i
cs: úroveň černé %i

source: white point
cs: bílý bod

source: raw black/white point correction only works for the sensors that need it.
cs: korekce černého/bílého bodu snímků raw pouze pro senzory, které to vyžadují.

source: fill-light 0.25EV with 4 zones
cs: přisvětlení 0,25EV se 4 zónami

source: fill-shadow -0.25EV with 4 zones
cs: ztmavení -0,25EV se 4 zónami

source: fill light
cs: přisvětlení

source: width
cs: šířka

source: the fill-light in EV
cs: přisvětlení v EV

source: width of fill-light area defined in zones
cs: šíře oblasti přisvětlení definovaná v zónách

source: select the center of fill-light ctrl+click to select an area
cs: vybrat střed přisvětlení ctrl+kliknutí pro výběr oblasti

source: toggle tool for picking median lightness in image
cs: přepnout nástroj pro vybrání středního jasu na snímku

source: retouch
cs: retušovat

source: cannot display scales when the blending mask is displayed
cs: když je zobrazena prolínací maska, nelze zobrazit měřítka

source: # shapes:
cs: # tvarů:

source: to add a shape select an algorithm and a shape type and click on the image. shapes are added to the current scale
cs: pro přidání tvaru zvolte algoritmus a druh tvaru a klikněte na snímek. tvary jsou přidány k aktuálnímu měřítku

source: show and edit shapes on the current scale
cs: ukázat a editovat tvary na aktuálním měřítku

source: algorithms:
cs: algoritmy:

source: activates fill tool
cs: aktivovat nástroj výplně

source: activates blur tool
cs: aktivuje nástroj rozmazání

source: activates healing tool
cs: aktivuje nástroj pro opravu

source: activates cloning tool
cs: aktivuje nástroj pro klonování

source: # scales:
cs: # měřítek:

source: current:
cs: aktuální:

source: merge from:
cs: sloučit z:

source: top slider adjusts where the merge scales start bottom slider adjusts the number of scales red box indicates the current scale green line indicates that the scale has shapes on it
cs: horní posuvník upravuje, kde začínají měřítka pro prolnutí spodní posuvník upravuje počet měřítek červené okénko indikuje aktuální měřítko zelená přímka indikuje, že měřítko obsahuje tvary

source: display masks
cs: zobrazit masky

source: temporarily switch off shapes
cs: dočasně vypnout tvary

source: display wavelet scale
cs: zobrazit vlnkové měřítko

source: cut shapes from current scale
cs: odstranit tvary z aktuálního měřítka

source: paste cut shapes to current scale
cs: vložit odstraněné tvary na aktuální měřítko

source: preview single scale
cs: náhled jednoho měřítka

source: adjust preview levels
cs: upravit úrovně náhledu

source: auto levels
cs: aplikovat automatické úrovně

source: shape selected:
cs: vybraný tvar:

source: click on a shape to select it, to unselect click on an empty space
cs: klikněte na tvar pro jeho výběr, pro zrušení výběru klikněte do prázdného místa

source: fill mode
cs: režim výplně

source: erase
cs: smazat

source: erase the detail or fills with chosen color
cs: smaže detail nebo vyplní vybranou barvou

source: select fill color
cs: vybrat barvu výplně

source: pick fill color from image
cs: vybrat barvu výplně z obrázku

source: fill color:
cs: barva výplně:

source: adjusts color brightness to fine-tune it. works with erase as well
cs: upraví jas barev pro jemné doladění. funguje i pro smazání

source: blur type
cs: typ rozmazání

source: bilateral
cs: bilaterální

source: type for the blur algorithm
cs: typ algoritmu pro rozmazání

source: blur radius
cs: poloměr rozmazání

source: radius of the selected blur type
cs: poloměr vybraného typu rozmazání

source: set the opacity on the selected shape
cs: nastavit krytí na vybraném tvaru

source: retouch tools
cs: nástroj retuše

source: shapes
cs: tvary

source: retouch tool circle
cs: kruh nástroje retuše

source: retouch tool ellipse
cs: elipsa nástroje retuše

source: retouch tool path
cs: cesta nástroje retuše

source: retouch tool brush
cs: štětec nástroje retuše

source: continuous add circle
cs: průběžné přidání kruhu

source: continuous add ellipse
cs: průběžné přidání elipsy

source: continuous add path
cs: přidání pokračující cesty

source: continuous add brush
cs: průběžné přidání štětce

source: max scale is %i for this image size
cs: maximální měřítko je %i pro tuto velikost snímku

source: rgb curve
cs: křivka rgb

source: contrast compression
cs: komprese kontrastu

source: gamma 1.0 (linear)
cs: gama 1.0 (lineární)

source: contrast - med (linear)
cs: kontrast - střední (lineární)

source: contrast - high (linear)
cs: kontrast - vysoký (lineární)

source: contrast - med (gamma 2.2)
cs: kontrast - střední (gama 2.2)

source: contrast - high (gamma 2.2)
cs: kontrast - vysoký (gama 2.2)

source: gamma 2.0
cs: gama 2.0

source: gamma 0.5
cs: gama 0.5

source: logarithm (base 2)
cs: logaritmus (základ 2)

source: exponential (base 2)
cs: exponenciální (základ 2)

source: RGB, linked channels
cs: RGB, propojené kanály

source: RGB, independent channels
cs: RGB, nezávislé kanály

source: choose between linked and independent channels.
cs: vybrat mezi propojenými a nezávislými kanály.

source: curve nodes for r channel
cs: uzly křivky pro r kanál

source: curve nodes for g channel
cs: uzly křivky pro L kanál

source: curve nodes for b channel
cs: uzly křivky pro b kanál

source: pick GUI color from image
cs: kliknutím vybrat barvu z obrázku

source: compensate middle grey
cs: kompenzovat střední šedou

source: rgb levels
cs: úrovně rgb

source: apply auto levels based on a region defined by the user click and drag to draw the area right click to cancel
cs: použít automatické úrovně dle oblasti definované uživatelem kliknutí a tažení pro namalování oblasti pravé kliknutí pro zrušení

source: rotate pixels
cs: otočit pixely

source: automatic pixel rotation
cs: automatické otočení pixelů

source: automatic pixel rotation only works for the sensors that need it.
cs: automatická rotace pixelů funguje pouze pro senzory, které to vyžadují.

source: scale pixels
cs: škálovat pixely

source: automatic pixel scaling
cs: automatické škálování pixelů

source: automatic pixel scaling only works for the sensors that need it.
cs: automatické škálování pixelů funguje pouze pro senzory, které to vyžadují.

source: shadows and highlights
cs: světla a stíny

source: white point adjustment
cs: úprava bílého bodu

source: compress
cs: stlačení

source: shadows color correction
cs: korekce barev ve stínech

source: highlights color correction
cs: korekce barev ve světlech

source: shadows color adjustment
cs: úprava barev ve stínech

source: highlights color adjustment
cs: úprava barev ve světlech

source: correct shadows
cs: opravit stíny

source: correct highlights
cs: opravit světla

source: shift white point
cs: posunout bílý bod

source: filter to use for softening. bilateral avoids halos
cs: filtr pro změkčení. bilateral zabrání halo efektu

source: compress the effect on shadows/highlights and preserve midtones
cs: stlačení efektu na světlech a stínech a zachování středních tónů

source: adjust saturation of shadows
cs: upravit sytost stínů

source: adjust saturation of highlights
cs: upravit sytost světel

source: spatial extent of the unblurring
cs: prostorová míra nerozmazání

source: strength of the sharpen
cs: síla doostření

source: threshold to activate sharpen
cs: práh pro aktivaci doostření

source: soften
cs: změkčit

source: the size of blur
cs: velikost rozmazání

source: the saturation of blur
cs: sytost rozmazání

source: the brightness of blur
cs: jas rozostření

source: the mix of effect
cs: mix efektu

source: split toning
cs: rozdělené tónování

source: pick primary color
cs: vybrat primární barvu

source: pick secondary color
cs: vybrat sekundární barvu

source: balance
cs: vyvážení

source: authentic sepia
cs: sépie

source: authentic cyanotype
cs: kyanotypie

source: authentic platinotype
cs: platinotypie

source: chocolate brown
cs: čokoládově hnědá

source: select tone color
cs: vybrat barvu tónu

source: select the saturation tone
cs: vybrat míru sytosti

source: the balance of center of splittoning
cs: vyvážení středu rozděleného tónování

source: compress the effect on highlights/shadows and preserve midtones
cs: stlačení efektu na světla/stíny a zachovat střední tóny

source: spot removal
cs: odstranění skvrn

source: number of strokes:
cs: počet tahů:

source: click on a shape and drag on canvas. use the mouse wheel to adjust size. right click to remove a shape.
cs: klikněte na tvar a tažením přesuňte. použijte rolování pro změnu velikosti. klikněte pravým tlačítkem pro odstranění tvaru.

source: spot circle tool
cs: nástroj bodového kruhu

source: spot ellipse tool
cs: nástroj bodových elips

source: spot path tool
cs: nástroj bodových cest

source: spot show or hide
cs: ukázat nebo skrýt bod

source: white balance
cs: vyvážení bílé

source: tint
cs: zbarvení

source: temperature
cs: teplota

source: preset/camera
cs: přednastavené/fotoparát

source: preset/camera neutral
cs: přednastavený/neutrální dle fotoaparátu

source: preset/spot
cs: přednastavené/bodové

source: camera
cs: fotoaparát

source: camera neutral
cs: neutrální dle fotoaparátu

source: spot
cs: bod

source: `%s' color matrix not found for image
cs: matice barev "%s" pro snímek nenalezena

source: failed to read camera white balance information from `%s'!
cs: selhalo čtení informace z "%s" o vyvážení bílé dle fotoaparátu!

source: magenta
cs: purpurová

source: cyan
cs: modrozelená

source: emerald
cs: smaragd

source: choose white balance preset from camera
cs: vybrat vyvážení bílé dle nastavení z fotoaparátu

source: finetune
cs: jemně

source: fine tune white balance preset
cs: jemně doladit předvolené vyvážení bílé

source: white balance disabled for camera
cs: vyvážení bílé vypnuto pro fotoaparát

source: tone curve
cs: tonální křivka

source: color space
cs: prostor barev

source: Lab, linked channels
cs: Lab, propojené kanály

source: Lab, independent channels
cs: Lab, nezávislé kanály

source: XYZ, linked channels
cs: XYZ, propojené kanály

source: if set to auto, a and b curves have no effect and are not displayed. chroma values (a and b) of each pixel are then adjusted based on L curve data. auto XYZ is similar but applies the saturation changes in XYZ space.
cs: pokud nastaveno na auto, křivky a a b nemají žádný vliv a nejsou zobrazeny. hodnoty chroma (a a b) každého pixelu jsou poté upraveny na základě křivky L. auto XYZ funguje podobně, ale ovlivňuje změny sytosti v prostoru XYZ.

source: tonecurve for L channel
cs: tonální křivka pro L kanál

source: tonecurve for a channel
cs: tonální křivka pro a kanál

source: tonecurve for b channel
cs: tonální křivka pro b kanál

source: log
cs: záznam

source: base of the logarithm
cs: základ logaritmu

source: tone equalizer
cs: tónový ekvalizér

source: blacks
cs: stíny

source: deep shadows
cs: hluboké stíny

source: light shadows
cs: světlé stíny

source: midtones
cs: střední tóny

source: dark highlights
cs: tmavá světla

source: whites
cs: světla

source: speculars
cs: zrcadlící

source: filter diffusion
cs: difúze filtru

source: smoothing diameter
cs: průměr vyhlazování

source: edges refinement or feathering
cs: doladění hran nebo prolínání okrajů

source: mask quantization
cs: kvantizace masky

source: mask exposure compensation
cs: kompenzace expozice masky

source: mask contrast compensation
cs: kompenzace kontrastu masky

source: mask blending : none
cs: prolínání masky: žádné

source: mask blending : landscapes
cs: prolínání masky: krajiny

source: mask blending : all purposes
cs: prolínání masky: všechny účely

source: mask blending : isolated subjects
cs: prolínání masky: samostatné předměty

source: compress shadows/highlights : soft
cs: stlačit stíny/světla: lehce

source: compress shadows/highlights : strong
cs: stlačit stíny/světla: silně

source: relight : fill-in
cs: znovu osvětlit: přisvětlení

source: tone equalizer needs to be after distorsion modules in the pipeline – disabled
cs: tónový ekvalizér musí být ve frontě za moduly zkreslení - zrušeno

source: tone equalizer failed to allocate memory, check your RAM settings
cs: selhala alokace paměti pro tónový ekvalizér, zkontrolujte nastavení RAM

source: tone equalizer in/out buffer are ill-aligned, please report the bug to the developers
cs: in/out vyrovnávací paměť tónového ekvalizéru není zarovnána, prosím nahlašte chybu vývojářům

source: the interpolation is unstable, decrease the curve smoothing
cs: interpolace je nestabilní, snižte vyhlazení křivky

source: wait for the preview to finish recomputing
cs: vyčkejte, až se dokončí výpočet

source: some parameters are out-of-bounds
cs: některé parametry jsou mimo rozsah

source: simple
cs: jednoduché

source: advanced
cs: pokročilé

source: masking
cs: maskování

source: double-click to reset the curve
cs: dvojitým kliknutím křivku obnovíte

source: curve smoothing
cs: vyhlazení křivky

source: positive values will produce more progressive tone transitions but the curve might become oscillatory in some settings. negative values will avoid oscillations and behave more robustly but may produce brutal tone transitions and damage local contrast.
cs: kladné hodnoty vedou k progresívnějšímu přechodu tónů, ale křivka může v některých nastaveních začít oscilovat. záporné hodnoty zabrání oscilaci a chová se robustněji, ale může způsobit brutální přechody tónů a poškodit lokální kontrast.

source: luminance estimator
cs: odhad svítivosti

source: RGB average
cs: průměr RGB

source: HSL lightness
cs: HSL světlost

source: RGB sum
cs: RGB suma

source: RGB geometric mean
cs: RGB geometrický průměr

source: preview the mask and chose the estimator that gives you the higher contrast between areas to dodge and areas to burn
cs: zobrazit náhled masky a vybrat vhodný odhad, který vede k vyššímu kontrastu mezi oblastmi pro ztmavení a zesvětlení

source: preserve details
cs: zachovat detaily

source: averaged guided filter
cs: zprůměrovaný vedený filtr

source: guided filter
cs: vedený filtr

source: 'no' affects global and local contrast (safe if you only add contrast) 'guided filter' only affects global contrast and tries to preserve local contrast 'averaged guided filter' is a geometric mean of both methods
cs: "ne" ovlivní globální a lokální kontrast (bezpečné, pokud pouze zvyšujete kontrast) "vedený filtr" ovlivní pouze globální kontrast a zkusí zachovat lokální kontrast "zprůměrovaný vedený filtr" je geometrický průměr obou metod

source: number of passes of guided filter to apply helps diffusing the edges of the filter at the expense of speed
cs: počet průchodů vedeného filtru pomáhá s difúzí hran filtru na úkor rychlosti

source: diameter of the blur in percent of the largest image size warning: big values of this parameter can make the darkroom preview much slower if denoise profiled is used.
cs: průměr rozmazání v procentech největší velikosti snímku varování: velké hodnoty parametru mohou vést k významnému zpomalení náhledu v režimu fotokomory, je-li použit profil odšumění.

source: edges refinement/feathering
cs: doladění hrad/prolínání okrajů

source: precision of the feathering : higher values force the mask to follow edges more closely but may void the effect of the smoothing lower values give smoother gradients and better smoothing but may lead to inaccurate edges taping and halos
cs: přesnost prolnutí okrajů: vyšší hodnoty donutí masku probíhat blízko okrajů, ale může zrušit efekt vyhlazování. nižší hodnoty vedou k hladším přechodům a lepšímu vyhlazování, ale mohou vést k nepřesným okrajům a halo efektu

source: mask post-processing
cs: následné zpracování masky

source: mask histogram span between the first and last deciles. the central line shows the average. orange bars appear at extrema if clipping occurs.
cs: maskovat rozložení historgramu mezi prvním a poslední decilem. prostřední linie ukazuje průměr. oranžové sloupce se zobrazí na krajích v případě ořezu jasů.

source: 0 disables the quantization. higher values posterize the luminance mask to help the guiding produce piece-wise smooth areas when using high feathering values
cs: 0 vypne kvantizaci. vyšší hodnoty posterizují masku svítivosti pro zlepšení vedení jsou-li použity vysoké hodnoty pro prolínání okrajů, vytvoří se vyhlazené oblasti okolo objektů

source: use this to slide the mask average exposure along channels for a better control of the exposure correction with the available nodes. the picker will auto-adjust the average exposure at -4EV.
cs: použít pro posun průměrné expozice masky podél kanálů pro lepší ovládání korekce expozice pomocí existujících uzlů. kapátko automaticky nastaví průměrnou expozici na -4 EV.

source: use this to counter the averaging effect of the guided filter and dilate the mask contrast around -4EV this allows to spread the exposure histogram over more channels for a better control of the exposure correction.
cs: použít pro kompenzaci průměrovacího efektu vedeného filtru a rozšíření kontrastu masky okolo -4 EV. toto umožní rozložit histogram expozice přes více kanálů pro lepší ovládání korekce expozice.

source: display exposure mask
cs: zobrazit masku expozice

source: tone mapping
cs: mapování tónů

source: vibrance
cs: živost

source: mid-tones bias
cs: vliv středních tónů

source: the strength of saturation boost
cs: míra zesílení sytosti

source: how much to spare highlights and shadows
cs: kolik zachovat světel a stínů

source: the amount of vibrance
cs: míra živosti

source: vignetting
cs: vinětace

source: fall-off strength
cs: síla ztmavení

source: horizontal center
cs: horizontální střed

source: vertical center
cs: vertikální střed

source: shape
cs: tvar

source: width-height ratio
cs: poměr šířka/výška

source: automatic ratio
cs: automatický poměr

source: 8-bit output
cs: 8bitový výstup

source: 16-bit output
cs: 16bitový výstup

source: width/height ratio
cs: poměr šířka/výška

source: the radii scale of vignette for start of fall-off
cs: měřítko poloměru vinětace pro začátek ztmavení

source: the radii scale of vignette for end of fall-off
cs: měřítko poloměru vinětace pro konec ztmavení

source: strength of effect on brightness
cs: vliv efektu na jas

source: strength of effect on saturation
cs: vliv efektu na sytost

source: horizontal offset of center of the effect
cs: horizontální posun středu efektu

source: vertical offset of center of the effect
cs: vertikální posun středu efektu

source: shape factor 0 produces a rectangle 1 produces a circle or ellipse 2 produces a diamond
cs: faktor tvaru 0 vytvoří obdélník 1 vytvoří kruh nebo elipsu 2 vytvoří diamand
